Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70a/edc/ATSAMS70Q20.PIC
      <edc:SFRDef edc:_addr="0x400E0720" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrr-------" edc:cname="PMC_SLPWK_ASR0" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="PID7" edc:desc="Peripheral 7 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID8" edc:desc="Peripheral 8 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID9" edc:desc="Peripheral 9 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID10" edc:desc="Peripheral 10 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID11" edc:desc="Peripheral 11 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID12" edc:desc="Peripheral 12 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID13" edc:desc="Peripheral 13 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID14" edc:desc="Peripheral 14 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID15" edc:desc="Peripheral 15 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID16" edc:desc="Peripheral 16 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID17" edc:desc="Peripheral 17 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID18" edc:desc="Peripheral 18 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID19" edc:desc="Peripheral 19 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID20" edc:desc="Peripheral 20 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID21" edc:desc="Peripheral 21 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID22" edc:desc="Peripheral 22 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID23" edc:desc="Peripheral 23 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID24" edc:desc="Peripheral 24 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID25" edc:desc="Peripheral 25 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID26" edc:desc="Peripheral 26 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID27" edc:desc="Peripheral 27 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID28" edc:desc="Peripheral 28 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID29" edc:desc="Peripheral 29 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID30" edc:desc="Peripheral 30 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID31" edc:desc="Peripheral 31 Activity Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x400E0724" edc:offset="0xC"/>
      <edc:SFRDef edc:_addr="0x400E0730" edc:access="---------------------nnnnnnnnnnn" edc:cname="PMC_PMMR" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PLLA_MMAX" edc:desc="PLLA Maximum Allowed Multiplier Value" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0734" edc:access="---wwwww--wwwwwwwwwwwwwww-w-wwww" edc:cname="PMC_SLPWK_ER1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral 32 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral 33 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral 34 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral 35 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral 37 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral 39 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral 40 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral 41 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral 42 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral 43 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral 44 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral 45 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral 46 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral 47 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral 48 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral 49 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral 50 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral 51 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral 52 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral 53 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral 56 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral 57 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral 58 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral 59 SleepWalking Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral 60 SleepWalking Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0738" edc:access="---wwwww--wwwwwwwwwwwwwww-w-wwww" edc:cname="PMC_SLPWK_DR1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral 32 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral 33 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral 34 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral 35 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral 37 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral 39 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral 40 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral 41 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral 42 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral 43 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral 44 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral 45 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral 46 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral 47 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral 48 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral 49 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral 50 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral 51 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral 52 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral 53 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral 56 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral 57 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral 58 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral 59 SleepWalking Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral 60 SleepWalking Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E073C" edc:access="---rrrrr--rrrrrrrrrrrrrrr-r-rrrr" edc:cname="PMC_SLPWK_SR1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral 32 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral 33 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral 34 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral 35 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral 37 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral 39 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral 40 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral 41 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral 42 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral 43 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral 44 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral 45 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral 46 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral 47 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral 48 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral 49 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral 50 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral 51 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral 52 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral 53 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral 56 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral 57 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral 58 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral 59 SleepWalking Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral 60 SleepWalking Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x400E0740" edc:access="---rrrrr--rrrrrrrrrrrrrrr-r-rrrr" edc:cname="PMC_SLPWK_ASR1" edc:nzwidth="0x20" ltx:memberofperipheral="PMC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PID32" edc:desc="Peripheral 32 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID33" edc:desc="Peripheral 33 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID34" edc:desc="Peripheral 34 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID35" edc:desc="Peripheral 35 Activity Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID37" edc:desc="Peripheral 37 Activity Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PID39" edc:desc="Peripheral 39 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID40" edc:desc="Peripheral 40 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID41" edc:desc="Peripheral 41 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID42" edc:desc="Peripheral 42 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID43" edc:desc="Peripheral 43 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID44" edc:desc="Peripheral 44 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID45" edc:desc="Peripheral 45 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID46" edc:desc="Peripheral 46 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID47" edc:desc="Peripheral 47 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID48" edc:desc="Peripheral 48 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID49" edc:desc="Peripheral 49 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID50" edc:desc="Peripheral 50 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID51" edc:desc="Peripheral 51 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID52" edc:desc="Peripheral 52 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID53" edc:desc="Peripheral 53 Activity Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PID56" edc:desc="Peripheral 56 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID57" edc:desc="Peripheral 57 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID58" edc:desc="Peripheral 58 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID59" edc:desc="Peripheral 59 Activity Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID60" edc:desc="Peripheral 60 Activity Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
